#!/usr/bin/env python3

from const import*
from receiver import*
from krl_rec import*

#--настройка приемника----------------------------------------------------
rec2 = krl()
rec2.channel = "right"
rec2.frequency = 525
rec2.code = 0x2C

#-------------------------------------------------------------------------

#-запуск приемника---------------------------------------------------------
rec2.stream.start()

#-------------------------------------------------------------------------

input("...Press Enter to exit...")
#--------------------------------------------------------------------------

